In [414]:
import pandas as pd
import numpy as np

In [415]:
df = pd.read_csv('zomato.csv')
df.head()

,url,address,name,online_order,book_table,rate,votes,phone,location,rest_type,dish_liked,cuisines,approx_cost(for two people),reviews_list,menu_item,listed_in(type),listed_in(city)
0,https://www.zomato.com/bangalore/jalsa-banasha...,"942, 21st Main Road, 2nd Stage, Banashankari, ...",Jalsa,Yes,Yes,4.1/5,775,080 42297555\r\n+91 9743772233,Banashankari,Casual Dining,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800,"[('Rated 4.0', 'RATED\n A beautiful place to ...",[],Buffet,Banashankari
1,https://www.zomato.com/bangalore/spice-elephan...,"2nd Floor, 80 Feet Road, Near Big Bazaar, 6th ...",Spice Elephant,Yes,No,4.1/5,787,080 41714161,Banashankari,Casual Dining,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800,"[('Rated 4.0', 'RATED\n Had been here for din...",[],Buffet,Banashankari
2,https://www.zomato.com/SanchurroBangalore?cont...,"1112, Next to KIMS Medical College, 17th Cross...",San Churro Cafe,Yes,No,3.8/5,918,+91 9663487993,Banashankari,"Cafe, Casual Dining","Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800,"[('Rated 3.0', ""RATED\n Ambience is not that ...",[],Buffet,Banashankari
3,https://www.zomato.com/bangalore/addhuri-udupi...,"1st Floor, Annakuteera, 3rd Stage, Banashankar...",Addhuri Udupi Bhojana,No,No,3.7/5,88,+91 9620009302,Banashankari,Quick Bites,Masala Dosa,"South Indian, North Indian",300,"[('Rated 4.0', ""RATED\n Great food and proper...",[],Buffet,Banashankari
4,https://www.zomato.com/bangalore/grand-village...,"10, 3rd Floor, Lakshmi Associates, Gandhi Baza...",Grand Village,No,No,3.8/5,166,+91 8026612447\r\n+91 9901210005,Basavanagudi,Casual Dining,"Panipuri, Gol Gappe","North Indian, Rajasthani",600,"[('Rated 4.0', 'RATED\n Very good restaurant ...",[],Buffet,Banashankari

In [416]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51717 entries, 0 to 51716
Data columns (total 17 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   url                          51717 non-null  object
 1   address                      51717 non-null  object
 2   name                         51717 non-null  object
 3   online_order                 51717 non-null  object
 4   book_table                   51717 non-null  object
 5   rate                         43942 non-null  object
 6   votes                        51717 non-null  int64
 7   phone                        50509 non-null  object
 8   location                     51696 non-null  object
 9   rest_type                    51490 non-null  object
 10  dish_liked                   23639 non-null  object
 11  cuisines                     51672 non-null  object
 12  approx_cost(for two people)  51371 non-null  object
 13  reviews_list                 51717 non-null  object
 14  menu_item                    51717 non-null  object
 15  listed_in(type)              51717 non-null  object
 16  listed_in(city)              51717 non-null  object
dtypes: int64(1), object(16)
memory usage: 6.7+ MB

In [417]:
df.shape

(51717, 17)

# Data Cleaning:

#### 1. Deleting redundant columns.
#### 2. Renaming the columns.
#### 3. Dropping duplicates.
#### 4. Cleaning individual columns.
#### 5. Remove the NaN values from the dataset
#### 6. Check for some more Transformations

In [418]:
df.columns

Index(['url', 'address', 'name', 'online_order', 'book_table', 'rate', 'votes',
       'phone', 'location', 'rest_type', 'dish_liked', 'cuisines',
       'approx_cost(for two people)', 'reviews_list', 'menu_item',
       'listed_in(type)', 'listed_in(city)'],
      dtype='object')

In [419]:
colums_to_keep = ['name', 'online_order', 'book_table', 'rate', 'votes', 'dish_liked', 
                  'cuisines', 'approx_cost(for two people)']
colums_to_drop = ['url', 'address', 'phone', 'location', 'rest_type', 'reviews_list', 
                  'menu_item', 'listed_in(type)', 'listed_in(city)']

In [420]:
df = df[colums_to_keep]

In [421]:
df.shape

(51717, 8)

In [422]:
df.head()

,name,online_order,book_table,rate,votes,dish_liked,cuisines,approx_cost(for two people)
0,Jalsa,Yes,Yes,4.1/5,775,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800
1,Spice Elephant,Yes,No,4.1/5,787,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800
2,San Churro Cafe,Yes,No,3.8/5,918,"Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,Masala Dosa,"South Indian, North Indian",300
4,Grand Village,No,No,3.8/5,166,"Panipuri, Gol Gappe","North Indian, Rajasthani",600

In [423]:
df.columns = df.columns.str.upper()
df.columns = df.columns.str.replace('_',' ', regex=True)

In [424]:
df.head()

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,DISH LIKED,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,Jalsa,Yes,Yes,4.1/5,775,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800
1,Spice Elephant,Yes,No,4.1/5,787,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800
2,San Churro Cafe,Yes,No,3.8/5,918,"Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,Masala Dosa,"South Indian, North Indian",300
4,Grand Village,No,No,3.8/5,166,"Panipuri, Gol Gappe","North Indian, Rajasthani",600

In [425]:
df.duplicated().sum()
df.drop_duplicates(inplace=True)

In [426]:
df.shape

(22752, 8)

In [427]:
df.head()

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,DISH LIKED,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,Jalsa,Yes,Yes,4.1/5,775,"Pasta, Lunch Buffet, Masala Papad, Paneer Laja...","North Indian, Mughlai, Chinese",800
1,Spice Elephant,Yes,No,4.1/5,787,"Momos, Lunch Buffet, Chocolate Nirvana, Thai G...","Chinese, North Indian, Thai",800
2,San Churro Cafe,Yes,No,3.8/5,918,"Churros, Cannelloni, Minestrone Soup, Hot Choc...","Cafe, Mexican, Italian",800
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,Masala Dosa,"South Indian, North Indian",300
4,Grand Village,No,No,3.8/5,166,"Panipuri, Gol Gappe","North Indian, Rajasthani",600

In [428]:
df.isna().sum()

NAME                               0
ONLINE ORDER                       0
BOOK TABLE                         0
RATE                            2464
VOTES                              0
DISH LIKED                     11444
CUISINES                          28
APPROX COST(FOR TWO PEOPLE)      141
dtype: int64

In [429]:
df.drop(columns='DISH LIKED', inplace=True)
df

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,Jalsa,Yes,Yes,4.1/5,775,"North Indian, Mughlai, Chinese",800
1,Spice Elephant,Yes,No,4.1/5,787,"Chinese, North Indian, Thai",800
2,San Churro Cafe,Yes,No,3.8/5,918,"Cafe, Mexican, Italian",800
3,Addhuri Udupi Bhojana,No,No,3.7/5,88,"South Indian, North Indian",300
4,Grand Village,No,No,3.8/5,166,"North Indian, Rajasthani",600
...,...,...,...,...,...,...,...
51631,Just Parathas,No,No,3.4 /5,5,North Indian,250
51632,SeeYa Restaurant,No,No,3.3 /5,4,"North Indian, Kerala, Chinese",350
51641,Andhra Spices,No,No,3.2 /5,4,"Andhra, Chinese, South Indian",NaN
51677,Bhagini,No,No,2.5 /5,81,"Andhra, South Indian, Chinese, North Indian",800
51714,Plunge - Sheraton Grand Bengaluru Whitefield H...,No,No,NaN,0,Finger Food,"2,000"

In [430]:
df.isna().sum()

NAME                              0
ONLINE ORDER                      0
BOOK TABLE                        0
RATE                           2464
VOTES                             0
CUISINES                         28
APPROX COST(FOR TWO PEOPLE)     141
dtype: int64

In [431]:
del colums_to_drop

In [432]:
df['NAME'] = df['NAME'].str.upper()
df.head()

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,JALSA,Yes,Yes,4.1/5,775,"North Indian, Mughlai, Chinese",800
1,SPICE ELEPHANT,Yes,No,4.1/5,787,"Chinese, North Indian, Thai",800
2,SAN CHURRO CAFE,Yes,No,3.8/5,918,"Cafe, Mexican, Italian",800
3,ADDHURI UDUPI BHOJANA,No,No,3.7/5,88,"South Indian, North Indian",300
4,GRAND VILLAGE,No,No,3.8/5,166,"North Indian, Rajasthani",600

In [433]:
df['ONLINE ORDER'] = df['ONLINE ORDER'].str.strip().str.upper()
df['ONLINE ORDER'] = df['ONLINE ORDER'].map({'YES':1 , 'NO':0})
df.head()

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,JALSA,1,Yes,4.1/5,775,"North Indian, Mughlai, Chinese",800
1,SPICE ELEPHANT,1,No,4.1/5,787,"Chinese, North Indian, Thai",800
2,SAN CHURRO CAFE,1,No,3.8/5,918,"Cafe, Mexican, Italian",800
3,ADDHURI UDUPI BHOJANA,0,No,3.7/5,88,"South Indian, North Indian",300
4,GRAND VILLAGE,0,No,3.8/5,166,"North Indian, Rajasthani",600

In [434]:
df['BOOK TABLE'] = df['BOOK TABLE'].str.strip().str.upper()
df['BOOK TABLE'] = df['BOOK TABLE'].map({'YES':1,'NO':0})
df.head()

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,JALSA,1,1,4.1/5,775,"North Indian, Mughlai, Chinese",800
1,SPICE ELEPHANT,1,0,4.1/5,787,"Chinese, North Indian, Thai",800
2,SAN CHURRO CAFE,1,0,3.8/5,918,"Cafe, Mexican, Italian",800
3,ADDHURI UDUPI BHOJANA,0,0,3.7/5,88,"South Indian, North Indian",300
4,GRAND VILLAGE,0,0,3.8/5,166,"North Indian, Rajasthani",600

In [435]:
df['RATE'].fillna('',inplace=True)

C:\Users\might\AppData\Local\Temp\ipykernel_9724\3801353781.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['RATE'].fillna('',inplace=True)

In [436]:
df['RATE'].isna().sum()

np.int64(0)

In [437]:
df.isna().sum()

NAME                             0
ONLINE ORDER                     0
BOOK TABLE                       0
RATE                             0
VOTES                            0
CUISINES                        28
APPROX COST(FOR TWO PEOPLE)    141
dtype: int64

In [438]:
df['CUISINES'].isna().sum()

np.int64(28)

In [439]:
df = df.dropna(subset=['CUISINES'])

In [440]:
df.isna().sum()

NAME                             0
ONLINE ORDER                     0
BOOK TABLE                       0
RATE                             0
VOTES                            0
CUISINES                         0
APPROX COST(FOR TWO PEOPLE)    125
dtype: int64

In [441]:
df['APPROX COST(FOR TWO PEOPLE)'] = df['APPROX COST(FOR TWO PEOPLE)'].str.replace(',','')

C:\Users\might\AppData\Local\Temp\ipykernel_9724\170245865.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['APPROX COST(FOR TWO PEOPLE)'] = df['APPROX COST(FOR TWO PEOPLE)'].str.replace(',','')

In [442]:
df.dtypes

NAME                           object
ONLINE ORDER                    int64
BOOK TABLE                      int64
RATE                           object
VOTES                           int64
CUISINES                       object
APPROX COST(FOR TWO PEOPLE)    object
dtype: object

In [443]:
df['APPROX COST(FOR TWO PEOPLE)'] = df['APPROX COST(FOR TWO PEOPLE)'].astype(float)

C:\Users\might\AppData\Local\Temp\ipykernel_9724\1333000668.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['APPROX COST(FOR TWO PEOPLE)'] = df['APPROX COST(FOR TWO PEOPLE)'].astype(float)

In [444]:
df.dtypes

NAME                            object
ONLINE ORDER                     int64
BOOK TABLE                       int64
RATE                            object
VOTES                            int64
CUISINES                        object
APPROX COST(FOR TWO PEOPLE)    float64
dtype: object

In [445]:
df.isna().sum()

NAME                             0
ONLINE ORDER                     0
BOOK TABLE                       0
RATE                             0
VOTES                            0
CUISINES                         0
APPROX COST(FOR TWO PEOPLE)    125
dtype: int64

In [446]:
df['APPROX COST(FOR TWO PEOPLE)'].isna().sum()

np.int64(125)

In [447]:
df['APPROX COST(FOR TWO PEOPLE)'] = df['APPROX COST(FOR TWO PEOPLE)'].fillna(df['APPROX COST(FOR TWO PEOPLE)'].mean())

C:\Users\might\AppData\Local\Temp\ipykernel_9724\2550601967.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['APPROX COST(FOR TWO PEOPLE)'] = df['APPROX COST(FOR TWO PEOPLE)'].fillna(df['APPROX COST(FOR TWO PEOPLE)'].mean())

In [448]:
df.isna().sum()

NAME                           0
ONLINE ORDER                   0
BOOK TABLE                     0
RATE                           0
VOTES                          0
CUISINES                       0
APPROX COST(FOR TWO PEOPLE)    0
dtype: int64

In [449]:
df['APPROX COST(FOR TWO PEOPLE)'] = df['APPROX COST(FOR TWO PEOPLE)'].astype(int)

C:\Users\might\AppData\Local\Temp\ipykernel_9724\1816800305.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['APPROX COST(FOR TWO PEOPLE)'] = df['APPROX COST(FOR TWO PEOPLE)'].astype(int)

In [450]:
df.dtypes

NAME                           object
ONLINE ORDER                    int64
BOOK TABLE                      int64
RATE                           object
VOTES                           int64
CUISINES                       object
APPROX COST(FOR TWO PEOPLE)     int64
dtype: object

In [451]:
df.head()

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,JALSA,1,1,4.1/5,775,"North Indian, Mughlai, Chinese",800
1,SPICE ELEPHANT,1,0,4.1/5,787,"Chinese, North Indian, Thai",800
2,SAN CHURRO CAFE,1,0,3.8/5,918,"Cafe, Mexican, Italian",800
3,ADDHURI UDUPI BHOJANA,0,0,3.7/5,88,"South Indian, North Indian",300
4,GRAND VILLAGE,0,0,3.8/5,166,"North Indian, Rajasthani",600

In [452]:
df['RATE'] = df['RATE'].str.split('/').str[0]

C:\Users\might\AppData\Local\Temp\ipykernel_9724\1871633224.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['RATE'] = df['RATE'].str.split('/').str[0]

In [453]:
df['RATE'].unique()

array(['4.1', '3.8', '3.7', '3.6', '4.6', '4.0', '4.2', '3.9', '3.1',
       '3.0', '3.2', '3.3', '2.8', '4.4', '4.3', 'NEW', '2.9', '3.5', '',
       '2.6', '3.8 ', '3.4', '4.5', '2.5', '2.7', '4.7', '2.4', '2.2',
       '2.3', '3.4 ', '-', '3.6 ', '4.8', '3.9 ', '4.2 ', '4.0 ', '4.1 ',
       '3.7 ', '3.1 ', '2.9 ', '3.3 ', '2.8 ', '3.5 ', '2.7 ', '2.5 ',
       '3.2 ', '2.6 ', '4.5 ', '4.3 ', '4.4 ', '4.9', '2.1', '2.0', '1.8',
       '4.6 ', '4.9 ', '3.0 ', '4.8 ', '2.3 ', '4.7 ', '2.4 ', '2.1 ',
       '2.2 ', '2.0 ', '1.8 '], dtype=object)

In [454]:
df['RATE']=df['RATE'].str.strip()

C:\Users\might\AppData\Local\Temp\ipykernel_9724\1987291274.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['RATE']=df['RATE'].str.strip()

In [455]:
df['RATE'].unique()

array(['4.1', '3.8', '3.7', '3.6', '4.6', '4.0', '4.2', '3.9', '3.1',
       '3.0', '3.2', '3.3', '2.8', '4.4', '4.3', 'NEW', '2.9', '3.5', '',
       '2.6', '3.4', '4.5', '2.5', '2.7', '4.7', '2.4', '2.2', '2.3', '-',
       '4.8', '4.9', '2.1', '2.0', '1.8'], dtype=object)

In [456]:
df['RATE']=df['RATE'].str.replace('NEW','')
df['RATE']=df['RATE'].str.replace('-','')

C:\Users\might\AppData\Local\Temp\ipykernel_9724\1106353965.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['RATE']=df['RATE'].str.replace('NEW','')
C:\Users\might\AppData\Local\Temp\ipykernel_9724\1106353965.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['RATE']=df['RATE'].str.replace('-','')

In [457]:
df['RATE'].unique()

array(['4.1', '3.8', '3.7', '3.6', '4.6', '4.0', '4.2', '3.9', '3.1',
       '3.0', '3.2', '3.3', '2.8', '4.4', '4.3', '', '2.9', '3.5', '2.6',
       '3.4', '4.5', '2.5', '2.7', '4.7', '2.4', '2.2', '2.3', '4.8',
       '4.9', '2.1', '2.0', '1.8'], dtype=object)

In [458]:
df['RATE'] = df['RATE'].replace('',np.nan)

C:\Users\might\AppData\Local\Temp\ipykernel_9724\1821592310.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['RATE'] = df['RATE'].replace('',np.nan)

In [459]:
df['RATE'].isna().sum()

np.int64(3357)

In [460]:
df.isna().sum()

NAME                              0
ONLINE ORDER                      0
BOOK TABLE                        0
RATE                           3357
VOTES                             0
CUISINES                          0
APPROX COST(FOR TWO PEOPLE)       0
dtype: int64

In [461]:
df = df.dropna(subset=['RATE'])

In [462]:
df['RATE'] = df['RATE'].astype(float)

In [463]:
df.shape

(19367, 7)

In [464]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 19367 entries, 0 to 51677
Data columns (total 7 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   NAME                         19367 non-null  object
 1   ONLINE ORDER                 19367 non-null  int64
 2   BOOK TABLE                   19367 non-null  int64
 3   RATE                         19367 non-null  float64
 4   VOTES                        19367 non-null  int64
 5   CUISINES                     19367 non-null  object
 6   APPROX COST(FOR TWO PEOPLE)  19367 non-null  int64
dtypes: float64(1), int64(4), object(2)
memory usage: 1.2+ MB

In [465]:
df.head()

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,JALSA,1,1,4.1,775,"North Indian, Mughlai, Chinese",800
1,SPICE ELEPHANT,1,0,4.1,787,"Chinese, North Indian, Thai",800
2,SAN CHURRO CAFE,1,0,3.8,918,"Cafe, Mexican, Italian",800
3,ADDHURI UDUPI BHOJANA,0,0,3.7,88,"South Indian, North Indian",300
4,GRAND VILLAGE,0,0,3.8,166,"North Indian, Rajasthani",600

In [466]:
df.reset_index(drop=True)

,NAME,ONLINE ORDER,BOOK TABLE,RATE,VOTES,CUISINES,APPROX COST(FOR TWO PEOPLE)
0,JALSA,1,1,4.1,775,"North Indian, Mughlai, Chinese",800
1,SPICE ELEPHANT,1,0,4.1,787,"Chinese, North Indian, Thai",800
2,SAN CHURRO CAFE,1,0,3.8,918,"Cafe, Mexican, Italian",800
3,ADDHURI UDUPI BHOJANA,0,0,3.7,88,"South Indian, North Indian",300
4,GRAND VILLAGE,0,0,3.8,166,"North Indian, Rajasthani",600
...,...,...,...,...,...,...,...
19362,NOOK - ALOFT BENGALURU CESSNA BUSINESS PARK,0,1,4.2,411,"North Indian, Continental, Asian",1800
19363,JUST PARATHAS,0,0,3.4,5,North Indian,250
19364,SEEYA RESTAURANT,0,0,3.3,4,"North Indian, Kerala, Chinese",350
19365,ANDHRA SPICES,0,0,3.2,4,"Andhra, Chinese, South Indian",562
19366,BHAGINI,0,0,2.5,81,"Andhra, South Indian, Chinese, North Indian",800

In [467]:
df.to_excel('Zomato_cleaned.xlsx',index=False)